<details ><summary>plan for talos-bootstrap 2026-01-19 15:07:51 (UTC)</summary>
        <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # data.talos_client_configuration.talosconfig will be read during apply
  # (config refers to values not yet known)
 <= data "talos_client_configuration" "talosconfig" {
      + client_configuration = {
          + ca_certificate     = (known after apply)
          + client_certificate = (known after apply)
          + client_key         = (sensitive value)
        }
      + cluster_name         = "immanent-grove"
      + endpoints            = [
          + "10.0.0.50",
          + "10.0.0.51",
          + "10.0.0.52",
        ]
      + id                   = (known after apply)
      + talos_config         = (sensitive value)
    }

  # data.talos_machine_configuration.machineconfig["controlplane-1"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "talos_machine_configuration" "machineconfig" {
      + cluster_endpoint      = "https://cluster.internal.vw-ops.net:6443"
      + cluster_name          = "immanent-grove"
      + id                    = (known after apply)
      + machine_configuration = (sensitive value)
      + machine_secrets       = {
          + certs      = {
              + etcd               = {
                  + cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJmVENDQVNPZ0F3SUJBZ0lRYXg3MFlpV2VYOXliMlhRQ2lsdXdxVEFLQmdncWhrak9QUVFEQWpBUE1RMHcKQ3dZRFZRUUtFd1JsZEdOa01CNFhEVEkxTURFeU9UQTFNek14TTFvWERUTTFNREV5TnpBMU16TXhNMW93RHpFTgpNQXNHQTFVRUNoTUVaWFJqWkRCWk1CTUdCeXFHU000OUFnRUdDQ3FHU000OUF3RUhBMElBQkFQdXo4aDhrQWtxCmlFOEtLSzQ2WTczQ0hGcFVUZk1nYzcvVnVzTFBkeUppa0hOd1p2bzRGRS9HVjJFeTh0N0FjdHZHTEN4UjB2Q2cKMnliOHRPbWczdWFqWVRCZk1BNEdBMVVkRHdFQi93UUVBd0lDaERBZEJnTlZIU1VFRmpBVUJnZ3JCZ0VGQlFjRApBUVlJS3dZQkJRVUhBd0l3RHdZRFZSMFRBUUgvQkFVd0F3RUIvekFkQmdOVkhRNEVGZ1FVUENrS0NRdy9nZVlVCjZ6YjBQS0NwVDNxeGRiUXdDZ1lJS29aSXpqMEVBd0lEU0FBd1JRSWhBS1BPWnRUL04rMUphcVhOZC9JU1JkZDEKZ3cwK0dSUkFvVEVRbnk1aUJaaWlBaUFVeXU2ajYrU051UTkyMEhOTXVJdldqbmo0Y2JQdFJBbGRIUjF3KzhKdwpmZz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
                  + key  = (sensitive value)
                }
              + k8s                = {
                  + cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJpakNDQVMrZ0F3SUJBZ0lRSkhkUTdXbDRrSXJpaWk4am9vaStuakFLQmdncWhrak9QUVFEQWpBVk1STXcKRVFZRFZRUUtFd3ByZFdKbGNtNWxkR1Z6TUI0WERUSTFNREV5T1RBMU16TXhNMW9YRFRNMU1ERXlOekExTXpNeApNMW93RlRFVE1CRUdBMVVFQ2hNS2EzVmlaWEp1WlhSbGN6QlpNQk1HQnlxR1NNNDlBZ0VHQ0NxR1NNNDlBd0VICkEwSUFCTS9aZEVxYUVNZTFOK3BaOGdsQUpCM0tWZ2RIN3RHOGF1b2t5UXM4VjFMQWFGQWV4cFpEQjhuYzEzeEsKMFJDdG9RSVcyWUlkY3pjVXlDYTJEOEkrK2dhallUQmZNQTRHQTFVZER3RUIvd1FFQXdJQ2hEQWRCZ05WSFNVRQpGakFVQmdnckJnRUZCUWNEQVFZSUt3WUJCUVVIQXdJd0R3WURWUjBUQVFIL0JBVXdBd0VCL3pBZEJnTlZIUTRFCkZnUVV6V2I0T0dtcUEvWENYa2xXdC8rUHhNQ1pzK2t3Q2dZSUtvWkl6ajBFQXdJRFNRQXdSZ0loQU0vRXFlV0IKdFdtL05XaDF1ait2bVVJUWNFTUdzUWZ2Mm9UNVluc0xrTmVPQWlFQTkreXJMZlBOZ29JMGpOSTV3WFJmNjZCTQp1end6MVZ2NUQ2STJON05qRGM4PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
                  + key  = (sensitive value)
                }
              + k8s_aggregator     = {
                  + cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJZVENDQVFhZ0F3SUJBZ0lSQU4xeUxZcHFpVkhSdytyTHNieTRjb0l3Q2dZSUtvWkl6ajBFQXdJd0FEQWUKRncweU5UQXhNamt3TlRNek1UTmFGdzB6TlRBeE1qY3dOVE16TVROYU1BQXdXVEFUQmdjcWhrak9QUUlCQmdncQpoa2pPUFFNQkJ3TkNBQVNRZi9Zc0xsaVJJZTRWaUdkMXZablZ2RnBoUGY3bGZBZloxWU1NSXBOdXBKVmgycWR3ClhKdDlITTZIRGZUVXhGUWNlamJERFYzNytCRU44RkRXSlhXcm8yRXdYekFPQmdOVkhROEJBZjhFQkFNQ0FvUXcKSFFZRFZSMGxCQll3RkFZSUt3WUJCUVVIQXdFR0NDc0dBUVVGQndNQ01BOEdBMVVkRXdFQi93UUZNQU1CQWY4dwpIUVlEVlIwT0JCWUVGRnJHdXVLYTB6ZXYyTzl2bUdVQlozRXBqVWZ5TUFvR0NDcUdTTTQ5QkFNQ0Ewa0FNRVlDCklRRDFmZXdPUGFJQkJ5eTdCeVd3cnJnME9WMTVrYkFrcUxuNVpFRTdhSms4WlFJaEFOWWVUYXI2bTMvUHVTZnIKZ1o5U2NKcG5OcGV3a1RjNWZmVTRENm40QlNoQQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
                  + key  = (sensitive value)
                }
              + k8s_serviceaccount = {
                  + key = (sensitive value)
                }
              + os                 = {
                  + cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBcVd2NXFVRmppOVkxOFhlSEx6RDBjekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNVEk1TURVek16RXpXaGNOTXpVd01USTNNRFV6TXpFeldqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQU5Dc1FqYWNlSEVtZDlhUHh3Ymo2OVQ1TG93K2tUdGl5L2xGCmY2UTdnSG9UbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRk5QdHRMakl2d0crN0krRApoUW5mSHRhSzBQQUdNQVVHQXl0bGNBTkJBR3RqZ3lQZVBnb2xjR1J3cVhwdm11QXFLU3RvYmJ3eStaVDZsSHRCCnJnclU2cDRiWFBPTHdVdmVYZmRVTzdOWk9VQWU5QnNMUHBYMWE0aEc0Y2NlUncwPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
                  + key  = (sensitive value)
                }
            }
          + cluster    = {
              + id     = "XVryM8DHG_bJnZJNvkH2ranoEOgsS3mE830B-2Yrp44="
              + secret = (sensitive value)
            }
          + secrets    = {
              + bootstrap_token             = (sensitive value)
              + secretbox_encryption_secret = (sensitive value)
            }
          + trustdinfo = {
              + token = (sensitive value)
            }
        }
      + machine_type          = "controlplane"
    }

  # data.talos_machine_configuration.machineconfig["controlplane-2"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "talos_machine_configuration" "machineconfig" {
      + cluster_endpoint      = "https://cluster.internal.vw-ops.net:6443"
      + cluster_name          = "immanent-grove"
      + id                    = (known after apply)
      + machine_configuration = (sensitive value)
      + machine_secrets       = {
          + certs      = {
              + etcd               = {
                  + cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJmVENDQVNPZ0F3SUJBZ0lRYXg3MFlpV2VYOXliMlhRQ2lsdXdxVEFLQmdncWhrak9QUVFEQWpBUE1RMHcKQ3dZRFZRUUtFd1JsZEdOa01CNFhEVEkxTURFeU9UQTFNek14TTFvWERUTTFNREV5TnpBMU16TXhNMW93RHpFTgpNQXNHQTFVRUNoTUVaWFJqWkRCWk1CTUdCeXFHU000OUFnRUdDQ3FHU000OUF3RUhBMElBQkFQdXo4aDhrQWtxCmlFOEtLSzQ2WTczQ0hGcFVUZk1nYzcvVnVzTFBkeUppa0hOd1p2bzRGRS9HVjJFeTh0N0FjdHZHTEN4UjB2Q2cKMnliOHRPbWczdWFqWVRCZk1BNEdBMVVkRHdFQi93UUVBd0lDaERBZEJnTlZIU1VFRmpBVUJnZ3JCZ0VGQlFjRApBUVlJS3dZQkJRVUhBd0l3RHdZRFZSMFRBUUgvQkFVd0F3RUIvekFkQmdOVkhRNEVGZ1FVUENrS0NRdy9nZVlVCjZ6YjBQS0NwVDNxeGRiUXdDZ1lJS29aSXpqMEVBd0lEU0FBd1JRSWhBS1BPWnRUL04rMUphcVhOZC9JU1JkZDEKZ3cwK0dSUkFvVEVRbnk1aUJaaWlBaUFVeXU2ajYrU051UTkyMEhOTXVJdldqbmo0Y2JQdFJBbGRIUjF3KzhKdwpmZz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
                  + key  = (sensitive value)
                }
              + k8s                = {
                  + cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJpakNDQVMrZ0F3SUJBZ0lRSkhkUTdXbDRrSXJpaWk4am9vaStuakFLQmdncWhrak9QUVFEQWpBVk1STXcKRVFZRFZRUUtFd3ByZFdKbGNtNWxkR1Z6TUI0WERUSTFNREV5T1RBMU16TXhNMW9YRFRNMU1ERXlOekExTXpNeApNMW93RlRFVE1CRUdBMVVFQ2hNS2EzVmlaWEp1WlhSbGN6QlpNQk1HQnlxR1NNNDlBZ0VHQ0NxR1NNNDlBd0VICkEwSUFCTS9aZEVxYUVNZTFOK3BaOGdsQUpCM0tWZ2RIN3RHOGF1b2t5UXM4VjFMQWFGQWV4cFpEQjhuYzEzeEsKMFJDdG9RSVcyWUlkY3pjVXlDYTJEOEkrK2dhallUQmZNQTRHQTFVZER3RUIvd1FFQXdJQ2hEQWRCZ05WSFNVRQpGakFVQmdnckJnRUZCUWNEQVFZSUt3WUJCUVVIQXdJd0R3WURWUjBUQVFIL0JBVXdBd0VCL3pBZEJnTlZIUTRFCkZnUVV6V2I0T0dtcUEvWENYa2xXdC8rUHhNQ1pzK2t3Q2dZSUtvWkl6ajBFQXdJRFNRQXdSZ0loQU0vRXFlV0IKdFdtL05XaDF1ait2bVVJUWNFTUdzUWZ2Mm9UNVluc0xrTmVPQWlFQTkreXJMZlBOZ29JMGpOSTV3WFJmNjZCTQp1end6MVZ2NUQ2STJON05qRGM4PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
                  + key  = (sensitive value)
                }
              + k8s_aggregator     = {
                  + cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJZVENDQVFhZ0F3SUJBZ0lSQU4xeUxZcHFpVkhSdytyTHNieTRjb0l3Q2dZSUtvWkl6ajBFQXdJd0FEQWUKRncweU5UQXhNamt3TlRNek1UTmFGdzB6TlRBeE1qY3dOVE16TVROYU1BQXdXVEFUQmdjcWhrak9QUUlCQmdncQpoa2pPUFFNQkJ3TkNBQVNRZi9Zc0xsaVJJZTRWaUdkMXZablZ2RnBoUGY3bGZBZloxWU1NSXBOdXBKVmgycWR3ClhKdDlITTZIRGZUVXhGUWNlamJERFYzNytCRU44RkRXSlhXcm8yRXdYekFPQmdOVkhROEJBZjhFQkFNQ0FvUXcKSFFZRFZSMGxCQll3RkFZSUt3WUJCUVVIQXdFR0NDc0dBUVVGQndNQ01BOEdBMVVkRXdFQi93UUZNQU1CQWY4dwpIUVlEVlIwT0JCWUVGRnJHdXVLYTB6ZXYyTzl2bUdVQlozRXBqVWZ5TUFvR0NDcUdTTTQ5QkFNQ0Ewa0FNRVlDCklRRDFmZXdPUGFJQkJ5eTdCeVd3cnJnME9WMTVrYkFrcUxuNVpFRTdhSms4WlFJaEFOWWVUYXI2bTMvUHVTZnIKZ1o5U2NKcG5OcGV3a1RjNWZmVTRENm40QlNoQQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
                  + key  = (sensitive value)
                }
              + k8s_serviceaccount = {
                  + key = (sensitive value)
                }
              + os                 = {
                  + cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBcVd2NXFVRmppOVkxOFhlSEx6RDBjekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNVEk1TURVek16RXpXaGNOTXpVd01USTNNRFV6TXpFeldqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQU5Dc1FqYWNlSEVtZDlhUHh3Ymo2OVQ1TG93K2tUdGl5L2xGCmY2UTdnSG9UbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRk5QdHRMakl2d0crN0krRApoUW5mSHRhSzBQQUdNQVVHQXl0bGNBTkJBR3RqZ3lQZVBnb2xjR1J3cVhwdm11QXFLU3RvYmJ3eStaVDZsSHRCCnJnclU2cDRiWFBPTHdVdmVYZmRVTzdOWk9VQWU5QnNMUHBYMWE0aEc0Y2NlUncwPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
                  + key  = (sensitive value)
                }
            }
          + cluster    = {
              + id     = "XVryM8DHG_bJnZJNvkH2ranoEOgsS3mE830B-2Yrp44="
              + secret = (sensitive value)
            }
          + secrets    = {
              + bootstrap_token             = (sensitive value)
              + secretbox_encryption_secret = (sensitive value)
            }
          + trustdinfo = {
              + token = (sensitive value)
            }
        }
      + machine_type          = "controlplane"
    }

  # data.talos_machine_configuration.machineconfig["controlplane-3"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "talos_machine_configuration" "machineconfig" {
      + cluster_endpoint      = "https://cluster.internal.vw-ops.net:6443"
      + cluster_name          = "immanent-grove"
      + id                    = (known after apply)
      + machine_configuration = (sensitive value)
      + machine_secrets       = {
          + certs      = {
              + etcd               = {
                  + cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJmVENDQVNPZ0F3SUJBZ0lRYXg3MFlpV2VYOXliMlhRQ2lsdXdxVEFLQmdncWhrak9QUVFEQWpBUE1RMHcKQ3dZRFZRUUtFd1JsZEdOa01CNFhEVEkxTURFeU9UQTFNek14TTFvWERUTTFNREV5TnpBMU16TXhNMW93RHpFTgpNQXNHQTFVRUNoTUVaWFJqWkRCWk1CTUdCeXFHU000OUFnRUdDQ3FHU000OUF3RUhBMElBQkFQdXo4aDhrQWtxCmlFOEtLSzQ2WTczQ0hGcFVUZk1nYzcvVnVzTFBkeUppa0hOd1p2bzRGRS9HVjJFeTh0N0FjdHZHTEN4UjB2Q2cKMnliOHRPbWczdWFqWVRCZk1BNEdBMVVkRHdFQi93UUVBd0lDaERBZEJnTlZIU1VFRmpBVUJnZ3JCZ0VGQlFjRApBUVlJS3dZQkJRVUhBd0l3RHdZRFZSMFRBUUgvQkFVd0F3RUIvekFkQmdOVkhRNEVGZ1FVUENrS0NRdy9nZVlVCjZ6YjBQS0NwVDNxeGRiUXdDZ1lJS29aSXpqMEVBd0lEU0FBd1JRSWhBS1BPWnRUL04rMUphcVhOZC9JU1JkZDEKZ3cwK0dSUkFvVEVRbnk1aUJaaWlBaUFVeXU2ajYrU051UTkyMEhOTXVJdldqbmo0Y2JQdFJBbGRIUjF3KzhKdwpmZz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
                  + key  = (sensitive value)
                }
              + k8s                = {
                  + cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJpakNDQVMrZ0F3SUJBZ0lRSkhkUTdXbDRrSXJpaWk4am9vaStuakFLQmdncWhrak9QUVFEQWpBVk1STXcKRVFZRFZRUUtFd3ByZFdKbGNtNWxkR1Z6TUI0WERUSTFNREV5T1RBMU16TXhNMW9YRFRNMU1ERXlOekExTXpNeApNMW93RlRFVE1CRUdBMVVFQ2hNS2EzVmlaWEp1WlhSbGN6QlpNQk1HQnlxR1NNNDlBZ0VHQ0NxR1NNNDlBd0VICkEwSUFCTS9aZEVxYUVNZTFOK3BaOGdsQUpCM0tWZ2RIN3RHOGF1b2t5UXM4VjFMQWFGQWV4cFpEQjhuYzEzeEsKMFJDdG9RSVcyWUlkY3pjVXlDYTJEOEkrK2dhallUQmZNQTRHQTFVZER3RUIvd1FFQXdJQ2hEQWRCZ05WSFNVRQpGakFVQmdnckJnRUZCUWNEQVFZSUt3WUJCUVVIQXdJd0R3WURWUjBUQVFIL0JBVXdBd0VCL3pBZEJnTlZIUTRFCkZnUVV6V2I0T0dtcUEvWENYa2xXdC8rUHhNQ1pzK2t3Q2dZSUtvWkl6ajBFQXdJRFNRQXdSZ0loQU0vRXFlV0IKdFdtL05XaDF1ait2bVVJUWNFTUdzUWZ2Mm9UNVluc0xrTmVPQWlFQTkreXJMZlBOZ29JMGpOSTV3WFJmNjZCTQp1end6MVZ2NUQ2STJON05qRGM4PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
                  + key  = (sensitive value)
                }
              + k8s_aggregator     = {
                  + cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJZVENDQVFhZ0F3SUJBZ0lSQU4xeUxZcHFpVkhSdytyTHNieTRjb0l3Q2dZSUtvWkl6ajBFQXdJd0FEQWUKRncweU5UQXhNamt3TlRNek1UTmFGdzB6TlRBeE1qY3dOVE16TVROYU1BQXdXVEFUQmdjcWhrak9QUUlCQmdncQpoa2pPUFFNQkJ3TkNBQVNRZi9Zc0xsaVJJZTRWaUdkMXZablZ2RnBoUGY3bGZBZloxWU1NSXBOdXBKVmgycWR3ClhKdDlITTZIRGZUVXhGUWNlamJERFYzNytCRU44RkRXSlhXcm8yRXdYekFPQmdOVkhROEJBZjhFQkFNQ0FvUXcKSFFZRFZSMGxCQll3RkFZSUt3WUJCUVVIQXdFR0NDc0dBUVVGQndNQ01BOEdBMVVkRXdFQi93UUZNQU1CQWY4dwpIUVlEVlIwT0JCWUVGRnJHdXVLYTB6ZXYyTzl2bUdVQlozRXBqVWZ5TUFvR0NDcUdTTTQ5QkFNQ0Ewa0FNRVlDCklRRDFmZXdPUGFJQkJ5eTdCeVd3cnJnME9WMTVrYkFrcUxuNVpFRTdhSms4WlFJaEFOWWVUYXI2bTMvUHVTZnIKZ1o5U2NKcG5OcGV3a1RjNWZmVTRENm40QlNoQQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
                  + key  = (sensitive value)
                }
              + k8s_serviceaccount = {
                  + key = (sensitive value)
                }
              + os                 = {
                  + cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBcVd2NXFVRmppOVkxOFhlSEx6RDBjekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNVEk1TURVek16RXpXaGNOTXpVd01USTNNRFV6TXpFeldqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQU5Dc1FqYWNlSEVtZDlhUHh3Ymo2OVQ1TG93K2tUdGl5L2xGCmY2UTdnSG9UbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRk5QdHRMakl2d0crN0krRApoUW5mSHRhSzBQQUdNQVVHQXl0bGNBTkJBR3RqZ3lQZVBnb2xjR1J3cVhwdm11QXFLU3RvYmJ3eStaVDZsSHRCCnJnclU2cDRiWFBPTHdVdmVYZmRVTzdOWk9VQWU5QnNMUHBYMWE0aEc0Y2NlUncwPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
                  + key  = (sensitive value)
                }
            }
          + cluster    = {
              + id     = "XVryM8DHG_bJnZJNvkH2ranoEOgsS3mE830B-2Yrp44="
              + secret = (sensitive value)
            }
          + secrets    = {
              + bootstrap_token             = (sensitive value)
              + secretbox_encryption_secret = (sensitive value)
            }
          + trustdinfo = {
              + token = (sensitive value)
            }
        }
      + machine_type          = "controlplane"
    }

  # data.talos_machine_configuration.machineconfig["worker-1"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "talos_machine_configuration" "machineconfig" {
      + cluster_endpoint      = "https://cluster.internal.vw-ops.net:6443"
      + cluster_name          = "immanent-grove"
      + id                    = (known after apply)
      + machine_configuration = (sensitive value)
      + machine_secrets       = {
          + certs      = {
              + etcd               = {
                  + cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJmVENDQVNPZ0F3SUJBZ0lRYXg3MFlpV2VYOXliMlhRQ2lsdXdxVEFLQmdncWhrak9QUVFEQWpBUE1RMHcKQ3dZRFZRUUtFd1JsZEdOa01CNFhEVEkxTURFeU9UQTFNek14TTFvWERUTTFNREV5TnpBMU16TXhNMW93RHpFTgpNQXNHQTFVRUNoTUVaWFJqWkRCWk1CTUdCeXFHU000OUFnRUdDQ3FHU000OUF3RUhBMElBQkFQdXo4aDhrQWtxCmlFOEtLSzQ2WTczQ0hGcFVUZk1nYzcvVnVzTFBkeUppa0hOd1p2bzRGRS9HVjJFeTh0N0FjdHZHTEN4UjB2Q2cKMnliOHRPbWczdWFqWVRCZk1BNEdBMVVkRHdFQi93UUVBd0lDaERBZEJnTlZIU1VFRmpBVUJnZ3JCZ0VGQlFjRApBUVlJS3dZQkJRVUhBd0l3RHdZRFZSMFRBUUgvQkFVd0F3RUIvekFkQmdOVkhRNEVGZ1FVUENrS0NRdy9nZVlVCjZ6YjBQS0NwVDNxeGRiUXdDZ1lJS29aSXpqMEVBd0lEU0FBd1JRSWhBS1BPWnRUL04rMUphcVhOZC9JU1JkZDEKZ3cwK0dSUkFvVEVRbnk1aUJaaWlBaUFVeXU2ajYrU051UTkyMEhOTXVJdldqbmo0Y2JQdFJBbGRIUjF3KzhKdwpmZz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
                  + key  = (sensitive value)
                }
              + k8s                = {
                  + cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJpakNDQVMrZ0F3SUJBZ0lRSkhkUTdXbDRrSXJpaWk4am9vaStuakFLQmdncWhrak9QUVFEQWpBVk1STXcKRVFZRFZRUUtFd3ByZFdKbGNtNWxkR1Z6TUI0WERUSTFNREV5T1RBMU16TXhNMW9YRFRNMU1ERXlOekExTXpNeApNMW93RlRFVE1CRUdBMVVFQ2hNS2EzVmlaWEp1WlhSbGN6QlpNQk1HQnlxR1NNNDlBZ0VHQ0NxR1NNNDlBd0VICkEwSUFCTS9aZEVxYUVNZTFOK3BaOGdsQUpCM0tWZ2RIN3RHOGF1b2t5UXM4VjFMQWFGQWV4cFpEQjhuYzEzeEsKMFJDdG9RSVcyWUlkY3pjVXlDYTJEOEkrK2dhallUQmZNQTRHQTFVZER3RUIvd1FFQXdJQ2hEQWRCZ05WSFNVRQpGakFVQmdnckJnRUZCUWNEQVFZSUt3WUJCUVVIQXdJd0R3WURWUjBUQVFIL0JBVXdBd0VCL3pBZEJnTlZIUTRFCkZnUVV6V2I0T0dtcUEvWENYa2xXdC8rUHhNQ1pzK2t3Q2dZSUtvWkl6ajBFQXdJRFNRQXdSZ0loQU0vRXFlV0IKdFdtL05XaDF1ait2bVVJUWNFTUdzUWZ2Mm9UNVluc0xrTmVPQWlFQTkreXJMZlBOZ29JMGpOSTV3WFJmNjZCTQp1end6MVZ2NUQ2STJON05qRGM4PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
                  + key  = (sensitive value)
                }
              + k8s_aggregator     = {
                  + cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJZVENDQVFhZ0F3SUJBZ0lSQU4xeUxZcHFpVkhSdytyTHNieTRjb0l3Q2dZSUtvWkl6ajBFQXdJd0FEQWUKRncweU5UQXhNamt3TlRNek1UTmFGdzB6TlRBeE1qY3dOVE16TVROYU1BQXdXVEFUQmdjcWhrak9QUUlCQmdncQpoa2pPUFFNQkJ3TkNBQVNRZi9Zc0xsaVJJZTRWaUdkMXZablZ2RnBoUGY3bGZBZloxWU1NSXBOdXBKVmgycWR3ClhKdDlITTZIRGZUVXhGUWNlamJERFYzNytCRU44RkRXSlhXcm8yRXdYekFPQmdOVkhROEJBZjhFQkFNQ0FvUXcKSFFZRFZSMGxCQll3RkFZSUt3WUJCUVVIQXdFR0NDc0dBUVVGQndNQ01BOEdBMVVkRXdFQi93UUZNQU1CQWY4dwpIUVlEVlIwT0JCWUVGRnJHdXVLYTB6ZXYyTzl2bUdVQlozRXBqVWZ5TUFvR0NDcUdTTTQ5QkFNQ0Ewa0FNRVlDCklRRDFmZXdPUGFJQkJ5eTdCeVd3cnJnME9WMTVrYkFrcUxuNVpFRTdhSms4WlFJaEFOWWVUYXI2bTMvUHVTZnIKZ1o5U2NKcG5OcGV3a1RjNWZmVTRENm40QlNoQQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
                  + key  = (sensitive value)
                }
              + k8s_serviceaccount = {
                  + key = (sensitive value)
                }
              + os                 = {
                  + cert = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBcVd2NXFVRmppOVkxOFhlSEx6RDBjekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNVEk1TURVek16RXpXaGNOTXpVd01USTNNRFV6TXpFeldqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQU5Dc1FqYWNlSEVtZDlhUHh3Ymo2OVQ1TG93K2tUdGl5L2xGCmY2UTdnSG9UbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRk5QdHRMakl2d0crN0krRApoUW5mSHRhSzBQQUdNQVVHQXl0bGNBTkJBR3RqZ3lQZVBnb2xjR1J3cVhwdm11QXFLU3RvYmJ3eStaVDZsSHRCCnJnclU2cDRiWFBPTHdVdmVYZmRVTzdOWk9VQWU5QnNMUHBYMWE0aEc0Y2NlUncwPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
                  + key  = (sensitive value)
                }
            }
          + cluster    = {
              + id     = "XVryM8DHG_bJnZJNvkH2ranoEOgsS3mE830B-2Yrp44="
              + secret = (sensitive value)
            }
          + secrets    = {
              + bootstrap_token             = (sensitive value)
              + secretbox_encryption_secret = (sensitive value)
            }
          + trustdinfo = {
              + token = (sensitive value)
            }
        }
      + machine_type          = "worker"
    }

  # talos_cluster_kubeconfig.kubeconfig will be updated in-place
  ~ resource "talos_cluster_kubeconfig" "kubeconfig" {
      ~ client_configuration            = {
          ~ ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBcVd2NXFVRmppOVkxOFhlSEx6RDBjekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNVEk1TURVek16RXpXaGNOTXpVd01USTNNRFV6TXpFeldqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQU5Dc1FqYWNlSEVtZDlhUHh3Ymo2OVQ1TG93K2tUdGl5L2xGCmY2UTdnSG9UbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRk5QdHRMakl2d0crN0krRApoUW5mSHRhSzBQQUdNQVVHQXl0bGNBTkJBR3RqZ3lQZVBnb2xjR1J3cVhwdm11QXFLU3RvYmJ3eStaVDZsSHRCCnJnclU2cDRiWFBPTHdVdmVYZmRVTzdOWk9VQWU5QnNMUHBYMWE0aEc0Y2NlUncwPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
          ~ client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJobS9hdmRoWXd4b2Mrc0h1NmIzaktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5UQXhNamt3TlRNek1UTmFGdzB5TmpBeE1qa3dOVE16TVROYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQWl2ZVNNM3l3ZFhrVWlLQkVBL3ZDYlBSeUJ4U3M2aXVsCjd5UVJEK2hQUlNpalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCVFQ3YlM0eUw4QnZ1eVBnNFVKM3g3V2l0RHdCakFGQmdNclpYQURRUUJYWXRmMApSWlVWYXFQSVplcWJiVnJpT1ZVaXI0Vm5QS3BVVTZNcnJEL0pmMlVKQ0dUOVBJaEpXZ3poNmtUekg0TmdGZUU0CmRFa2RtMis1SCtrVXE1Z0cKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
          ~ client_key         = (sensitive value)
        }
        id                              = "immanent-grove"
        # (5 unchanged attributes hidden)
    }

  # talos_machine_bootstrap.bootstrap will be updated in-place
  ~ resource "talos_machine_bootstrap" "bootstrap" {
      ~ client_configuration = {
          ~ ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBcVd2NXFVRmppOVkxOFhlSEx6RDBjekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNVEk1TURVek16RXpXaGNOTXpVd01USTNNRFV6TXpFeldqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQU5Dc1FqYWNlSEVtZDlhUHh3Ymo2OVQ1TG93K2tUdGl5L2xGCmY2UTdnSG9UbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRk5QdHRMakl2d0crN0krRApoUW5mSHRhSzBQQUdNQVVHQXl0bGNBTkJBR3RqZ3lQZVBnb2xjR1J3cVhwdm11QXFLU3RvYmJ3eStaVDZsSHRCCnJnclU2cDRiWFBPTHdVdmVYZmRVTzdOWk9VQWU5QnNMUHBYMWE0aEc0Y2NlUncwPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
          ~ client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJobS9hdmRoWXd4b2Mrc0h1NmIzaktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5UQXhNamt3TlRNek1UTmFGdzB5TmpBeE1qa3dOVE16TVROYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQWl2ZVNNM3l3ZFhrVWlLQkVBL3ZDYlBSeUJ4U3M2aXVsCjd5UVJEK2hQUlNpalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCVFQ3YlM0eUw4QnZ1eVBnNFVKM3g3V2l0RHdCakFGQmdNclpYQURRUUJYWXRmMApSWlVWYXFQSVplcWJiVnJpT1ZVaXI0Vm5QS3BVVTZNcnJEL0pmMlVKQ0dUOVBJaEpXZ3poNmtUekg0TmdGZUU0CmRFa2RtMis1SCtrVXE1Z0cKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
          ~ client_key         = (sensitive value)
        }
        id                   = "machine_bootstrap"
        # (2 unchanged attributes hidden)
    }

  # talos_machine_configuration_apply.config_apply["controlplane-1"] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "config_apply" {
      ~ client_configuration        = {
          ~ ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBcVd2NXFVRmppOVkxOFhlSEx6RDBjekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNVEk1TURVek16RXpXaGNOTXpVd01USTNNRFV6TXpFeldqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQU5Dc1FqYWNlSEVtZDlhUHh3Ymo2OVQ1TG93K2tUdGl5L2xGCmY2UTdnSG9UbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRk5QdHRMakl2d0crN0krRApoUW5mSHRhSzBQQUdNQVVHQXl0bGNBTkJBR3RqZ3lQZVBnb2xjR1J3cVhwdm11QXFLU3RvYmJ3eStaVDZsSHRCCnJnclU2cDRiWFBPTHdVdmVYZmRVTzdOWk9VQWU5QnNMUHBYMWE0aEc0Y2NlUncwPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
          ~ client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJobS9hdmRoWXd4b2Mrc0h1NmIzaktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5UQXhNamt3TlRNek1UTmFGdzB5TmpBeE1qa3dOVE16TVROYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQWl2ZVNNM3l3ZFhrVWlLQkVBL3ZDYlBSeUJ4U3M2aXVsCjd5UVJEK2hQUlNpalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCVFQ3YlM0eUw4QnZ1eVBnNFVKM3g3V2l0RHdCakFGQmdNclpYQURRUUJYWXRmMApSWlVWYXFQSVplcWJiVnJpT1ZVaXI0Vm5QS3BVVTZNcnJEL0pmMlVKQ0dUOVBJaEpXZ3poNmtUekg0TmdGZUU0CmRFa2RtMis1SCtrVXE1Z0cKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
          ~ client_key         = (sensitive value)
        }
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
      ~ machine_configuration_input = (sensitive value)
      + resolved_apply_mode         = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # talos_machine_configuration_apply.config_apply["controlplane-2"] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "config_apply" {
      ~ client_configuration        = {
          ~ ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBcVd2NXFVRmppOVkxOFhlSEx6RDBjekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNVEk1TURVek16RXpXaGNOTXpVd01USTNNRFV6TXpFeldqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQU5Dc1FqYWNlSEVtZDlhUHh3Ymo2OVQ1TG93K2tUdGl5L2xGCmY2UTdnSG9UbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRk5QdHRMakl2d0crN0krRApoUW5mSHRhSzBQQUdNQVVHQXl0bGNBTkJBR3RqZ3lQZVBnb2xjR1J3cVhwdm11QXFLU3RvYmJ3eStaVDZsSHRCCnJnclU2cDRiWFBPTHdVdmVYZmRVTzdOWk9VQWU5QnNMUHBYMWE0aEc0Y2NlUncwPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
          ~ client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJobS9hdmRoWXd4b2Mrc0h1NmIzaktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5UQXhNamt3TlRNek1UTmFGdzB5TmpBeE1qa3dOVE16TVROYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQWl2ZVNNM3l3ZFhrVWlLQkVBL3ZDYlBSeUJ4U3M2aXVsCjd5UVJEK2hQUlNpalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCVFQ3YlM0eUw4QnZ1eVBnNFVKM3g3V2l0RHdCakFGQmdNclpYQURRUUJYWXRmMApSWlVWYXFQSVplcWJiVnJpT1ZVaXI0Vm5QS3BVVTZNcnJEL0pmMlVKQ0dUOVBJaEpXZ3poNmtUekg0TmdGZUU0CmRFa2RtMis1SCtrVXE1Z0cKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
          ~ client_key         = (sensitive value)
        }
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
      ~ machine_configuration_input = (sensitive value)
      + resolved_apply_mode         = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # talos_machine_configuration_apply.config_apply["controlplane-3"] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "config_apply" {
      ~ client_configuration        = {
          ~ ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBcVd2NXFVRmppOVkxOFhlSEx6RDBjekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNVEk1TURVek16RXpXaGNOTXpVd01USTNNRFV6TXpFeldqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQU5Dc1FqYWNlSEVtZDlhUHh3Ymo2OVQ1TG93K2tUdGl5L2xGCmY2UTdnSG9UbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRk5QdHRMakl2d0crN0krRApoUW5mSHRhSzBQQUdNQVVHQXl0bGNBTkJBR3RqZ3lQZVBnb2xjR1J3cVhwdm11QXFLU3RvYmJ3eStaVDZsSHRCCnJnclU2cDRiWFBPTHdVdmVYZmRVTzdOWk9VQWU5QnNMUHBYMWE0aEc0Y2NlUncwPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
          ~ client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJobS9hdmRoWXd4b2Mrc0h1NmIzaktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5UQXhNamt3TlRNek1UTmFGdzB5TmpBeE1qa3dOVE16TVROYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQWl2ZVNNM3l3ZFhrVWlLQkVBL3ZDYlBSeUJ4U3M2aXVsCjd5UVJEK2hQUlNpalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCVFQ3YlM0eUw4QnZ1eVBnNFVKM3g3V2l0RHdCakFGQmdNclpYQURRUUJYWXRmMApSWlVWYXFQSVplcWJiVnJpT1ZVaXI0Vm5QS3BVVTZNcnJEL0pmMlVKQ0dUOVBJaEpXZ3poNmtUekg0TmdGZUU0CmRFa2RtMis1SCtrVXE1Z0cKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
          ~ client_key         = (sensitive value)
        }
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
      ~ machine_configuration_input = (sensitive value)
      + resolved_apply_mode         = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # talos_machine_configuration_apply.config_apply["worker-1"] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "config_apply" {
      ~ client_configuration        = {
          ~ ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBcVd2NXFVRmppOVkxOFhlSEx6RDBjekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNVEk1TURVek16RXpXaGNOTXpVd01USTNNRFV6TXpFeldqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQU5Dc1FqYWNlSEVtZDlhUHh3Ymo2OVQ1TG93K2tUdGl5L2xGCmY2UTdnSG9UbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRk5QdHRMakl2d0crN0krRApoUW5mSHRhSzBQQUdNQVVHQXl0bGNBTkJBR3RqZ3lQZVBnb2xjR1J3cVhwdm11QXFLU3RvYmJ3eStaVDZsSHRCCnJnclU2cDRiWFBPTHdVdmVYZmRVTzdOWk9VQWU5QnNMUHBYMWE0aEc0Y2NlUncwPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
          ~ client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJobS9hdmRoWXd4b2Mrc0h1NmIzaktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5UQXhNamt3TlRNek1UTmFGdzB5TmpBeE1qa3dOVE16TVROYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQWl2ZVNNM3l3ZFhrVWlLQkVBL3ZDYlBSeUJ4U3M2aXVsCjd5UVJEK2hQUlNpalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCVFQ3YlM0eUw4QnZ1eVBnNFVKM3g3V2l0RHdCakFGQmdNclpYQURRUUJYWXRmMApSWlVWYXFQSVplcWJiVnJpT1ZVaXI0Vm5QS3BVVTZNcnJEL0pmMlVKQ0dUOVBJaEpXZ3poNmtUekg0TmdGZUU0CmRFa2RtMis1SCtrVXE1Z0cKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
          ~ client_key         = (sensitive value)
        }
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
      ~ machine_configuration_input = (sensitive value)
      + resolved_apply_mode         = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # talos_machine_secrets.machine_secrets will be updated in-place
  ~ resource "talos_machine_secrets" "machine_secrets" {
      ~ client_configuration = {
          ~ ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBcVd2NXFVRmppOVkxOFhlSEx6RDBjekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNVEk1TURVek16RXpXaGNOTXpVd01USTNNRFV6TXpFeldqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQU5Dc1FqYWNlSEVtZDlhUHh3Ymo2OVQ1TG93K2tUdGl5L2xGCmY2UTdnSG9UbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRk5QdHRMakl2d0crN0krRApoUW5mSHRhSzBQQUdNQVVHQXl0bGNBTkJBR3RqZ3lQZVBnb2xjR1J3cVhwdm11QXFLU3RvYmJ3eStaVDZsSHRCCnJnclU2cDRiWFBPTHdVdmVYZmRVTzdOWk9VQWU5QnNMUHBYMWE0aEc0Y2NlUncwPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
          ~ client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJobS9hdmRoWXd4b2Mrc0h1NmIzaktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5UQXhNamt3TlRNek1UTmFGdzB5TmpBeE1qa3dOVE16TVROYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQWl2ZVNNM3l3ZFhrVWlLQkVBL3ZDYlBSeUJ4U3M2aXVsCjd5UVJEK2hQUlNpalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCVFQ3YlM0eUw4QnZ1eVBnNFVKM3g3V2l0RHdCakFGQmdNclpYQURRUUJYWXRmMApSWlVWYXFQSVplcWJiVnJpT1ZVaXI0Vm5QS3BVVTZNcnJEL0pmMlVKQ0dUOVBJaEpXZ3poNmtUekg0TmdGZUU0CmRFa2RtMis1SCtrVXE1Z0cKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
          ~ client_key         = (sensitive value)
        }
        id                   = "machine_secrets"
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.

Changes to Outputs:
  ~ kubeconfig = (sensitive value)

─────────────────────────────────────────────────────────────────────────────
```
</details>

<details ><summary>Terraform plan validation check (talos-bootstrap)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |                              RESOURCE                              |
|--------|--------------------------------------------------------------------|
| update | `talos_cluster_kubeconfig.kubeconfig`                              |
|        | `talos_machine_bootstrap.bootstrap`                                |
|        | `talos_machine_configuration_apply.config_apply["controlplane-1"]` |
|        | `talos_machine_configuration_apply.config_apply["controlplane-2"]` |
|        | `talos_machine_configuration_apply.config_apply["controlplane-3"]` |
|        | `talos_machine_configuration_apply.config_apply["worker-1"]`       |
|        | `talos_machine_secrets.machine_secrets`                            |

| CHANGE |    OUTPUT    |
|--------|--------------|
| update | `kubeconfig` |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p talos-bootstrap
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>